{ 
    "cards": [

        {"append": "dragonholt-the-dracobog", "name": "Dragonholt, the Dracoborg", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/dragonholt-full-art.jpg", "text": "Bestowed the rank of Commander by Raoyenna, Dragonholt led his dragons to countless victories, claiming a large territory for the Fire Tower and its people. However, after nearly surviving a devastating explosion, his body was in severe condition. Raoyenna forced captured Skytree Mechanics to build Dragonholt a cybernetic body that would make him unstopable on the battlefield. Once repairs were made, Dragonholt is prepared to take on any army with extensive force!"},
        {"append": "jemial-cryptic-caster", "name": "Jemial, Cryptic Caster", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/jemial-full-art.jpg", "text": "The people of the Water Tower sought the power of the Water Shard as a way of enlightenment. Jemial, who was given his abilities by his father, knew that harnessing pure shardlight could unravel the mysteries of the shards. With these new advances in technology, Jemial and his people are able to cast powerful spells that protect allies and shut down enemies. With each ally casted by Jemial, a spirit link is formed that greatly increases his magical prowess on the battlefield."},
        {"append": "eitan-exiled-prince", "name": "Eitan, Exiled Prince", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/eitan-full-art.jpg", "text": "Eitan was always a troubled prince who enjoyed mischief more than presenting his royalty. That all changed after he was framed for an assassination attempt that tore apart a peace treaty between all the Elemental Towers. He was sentenced to be exiled to the Harsh Lands, a place where no being dares to venture. His armor, title, and reputation stripped from him, Eitan vowed to find the truth no matter the cost. As a lone wander, he gathers a rebellion Skytree Raiders who kept their oath to serve his side, without a doubt of his innocence. Whenever an ally falls weak in battle, Eitan orders a retreat to reveal a more powerful force to gain a foothold over the enemy."},
        {"append": "liam-traitor-of-knights", "name": "Liam, Traitor of Knights", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/liam-full-art.jpg", "text": "From an early age Liam was a gifted fighter and leader, the path of the Corum was too passive and weak in the Liams eyes; change must be done to preserve the true life for the people of the Light Tower. Liam banded together a legion of heretic knights and took complete control of the Light Tower, and with this control a new ideology would be established. The people of the light should be the true heir to Argos, and all who oppose must be destroyed. Now with this newfound power, Liam is prepared to unleash the power of the Corum by any means neccessary."},
        {"append": "hoenna-immoral-conjurer", "name": "Hoenna, Immoral Conjurer", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/hoenna-full-art.jpg", "text": "Hoenna was a witch from birth, and with the discovery of the Shards she took it upon herself to harness the pure magic ability contained within them. With the power of the dark shard, Hoenna is able to enhance her transmutation spells to create monstrocities that she calls Golems. Whenever she destroys an enemy in battle she and her spirit absorb the soul essence to summon a powerful golem and weaken opponents' defenses."},

        {"append": "corona-the-fire-spirit", "name": "Corona, the Fire Spirit", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/corona-full-art.jpg", "text": "After suffering his near fatal wound, Dragonholt sought his elders from the beyond in the bowels of the Erankai Mountains. The hot magma comforted him, dipping his hand into the molten rock he felt something unusual. The bone from a long lost dragon was in his grasp, and then a blinding light was seen at the center of the basin. Dragonholt stepped into the lava to inspect the source of this foerign light, and to his suprise is a Fire Shard. He picks up the shard as a salamander spirit wraps around his hand, and for the first time Dragonholt grins. With his new Fire Spirit, Corona is able to use the souls of fallen dragons to destroy any enemy that dares to challenge them. "},
        {"append": "fizzy-the-water-spirit", "name": "Fizzy, the Water Spirit", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/fizzy-full-art.jpg", "text": "Once the Water Shard was found, the people of the Water Tower praised it and hoped one day it would awaken, but alas it did not. It was foretold that the Spirit would only choose a being with a pure heart to be its protector. A young girl named Mirai found herself at the tomb of the Water Shard but noticed that the once beautiful light is faded away, concerned by this she slowly approached the Shard. She felt guided to cup her hands and hold them together; then like a miracle, a small blue frog formed in her hand. Fizzy is able to drain his light every so often to aid his allies when they need it most, however, they are unsure if the shardlight is too powerful for mortals."},
        {"append": "kyte-the-air-spirit", "name": "Kyte, the Air Spirit", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/kyte-full-art.jpg", "text": "While traversing the Harsh Lands, Eitan stumbles across an air shard burried in the sand. Upon dusting it off, it glows with intense light followed by gusts of raging winds knocking Eitan onto the hot desert ground. As he opens his eyes he is bewildered at the site of a ghostly hare jumping from floating boulders and almost in an instant appears right in front of him. Kyte uses a spiritual gusts of wind to aid his allies evade from impending danger."},
        {"append": "sola-the-light-spirit", "name": "Sola, the Light Spirit", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/sola-full-art.jpg", "text": "For some reason there was no lore for Sola but here's a picture I guess"},
        {"append": "luna-the-dark-spirit", "name": "Luna, the Dark Spirit", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/luna-full-art.jpg", "fun": "Fun Fact: If you look closely enough you can see that Luna wears glasses!", "text": "Ever since laying her eyes upon the Dark Shard, Hoenna was encapsulated by its beauty; its power was hers for the taking. Using dark art spells, she was able to extract the shardlight from deep within the shard. Just as she predicted the power chose her to be the Champion of the Dark Shard, and with that power a spirit would acompany her. She named her Spirit Luna, after the bright yellow eyes she had, the bond between them made Hoenna pleased to try out her more devious plans."},
        {"append": "buckeye-the-loyal", "name": "Buckeye, the Loyal", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/buckeye-full-art.jpg", "text": "Within the Light Tower itself a shrine was built for a fallen kings sword and his armor. When the Corum Guards were asleep, the items turned to dust and formed themselves into a crystal bone. The Guards awoke to a loyal spirit of a dog who always stands by to guard the bone. It became legend that the spirit would be named Buckeye for always staying loyal to his king."},

        {"append": "bone-scavager", "name": "Bone Scavager", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/buckeye-full-art.jpg", "text": "At the end of every battle, the fallen bodies are left behind where any survivors are faced with their last testiment. The Bone Scavagers are foul creatures that gorge their riches upon the dead. Hunting in packs, they can easily take down anything that survives until they can feast. When a scavager enters the battlefield it will spot any fallen creature in battle and devour it; for each body that it consumes, it becomes stronger as well."},
        {"append": "catrina-the-dark-lady", "name": "Catrina, the Dark Lady", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/buckeye-full-art.jpg", "text": "Every story isn't always so glee in the land of the Gloom District, and for Catrina, her life was filled with anger. Living in Hoenna's shadow since birth, Catrina despised her sister with every fiber of her being. She believed that it was her right to be Champion of the Dark Shard, but alas the shard did not choose her. Unlike her sister, Catrina needs to sacrifce allies to release her more powerful spells to summon powerful beings or in some cases, decieve her enemies."},
        {"append": "blazewalker-scout-leiah", "name": "Blazewalker Scout, Leiah", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/leiah-full-art.jpg", "text": "The arrivial of the Blazewalkers came with a quick decision to win the war, lead by their powerful leader Raine. His army were able to mow through the Corum and Iakuma with ease as his Blazewalkers are able to evade any attack that comes their by enroping their body in fire. Leiah was among the first Blazewalkers to step out of the shadows, and she is a crucial element for her people. Whenever she takes herself out of battle, she is able rejuvenate her allies and prepare for the next vital step toward victory."},
        {"append": "leviathan-the-ancient-serpent", "name": "Leviathan, the Ancient Serpent", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/buckeye-full-art.jpg", "text": "Tales as old as the shards themselves spoke of an ancient serpent that guards an underwater temple somewhere in the Bygleices Lake. Many fishermen and Iakuma who have come across this legend decribe the being to be \"One with the water gods\". Some say that the serpent has the power to take on the mightest forces that dare cross its territory."},
        {"append": "megashardmech-titan-yugo", "name": "Megashardmech Titan: Yugo", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/buckeye-full-art.jpg", "text": "Legend spoke of towering beings of an unknown origins, but at last a few explorers have uncovered the truth. An army of these shard mechas' were built by rogue mechanics to go toe to toe with the strongest of foes. All shard mecha's rely on their own synergy with other mecha's to dominate their opponents."},


        {"append": "ark-the-soaring-blazewalker", "name": "Ark, the Soaring Blazewalker", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/ark-the-soaring-blazewalker-full-art.jpg", "text": "Ark, the Soaring Blazewalker started as a young rookie, but during the war on Turrim he was forced to mature quickly into the fierce warrior he is today. After Raine, Corrupted by Grief left, Ark was left to step up and lead the Blazewalkers in the fight against the Silver Army.\n\nArk was a quick learner and finished at the top of his rookie class. He advanced through the ranks of the Blazewalkers quickly, and became an integral part of the Blazewalker army. Ark is most known for his fearlessness and his incredible speed. Leading the charge, Ark and the Blazewalker Army confront the Silver Army.\n\nSince his days as a rookie, Ark has grown and matured into a fierce warrior. He has absorbed a vast amount of Fire Shardlight, becoming stronger and more powerful. In his chest armor is a glowing red shard. He is lunging forward towards Raine, Corrupted by Grief with his spear outstretched. The Blazewalker Commander and the young rookie are now fighting for different sides."},
        {"append": "charise-archivist-of-worlds", "name": "Charise, Archivist of Worlds", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/charise-archivist-of-worlds-full-art.jpg", "text": "Knowledge is a very powerful weapon in the world of Argos, and Charise, Archivist of Worlds‘s strength comes directly from her knowledge. Her dedication to understanding and knowing about the world around her has contributed to her ability to find a solution to any problem.\n\nCharise, Archivist of Worlds is dedicated to knowledge, and thinks there is nothing more powerful. She travels the world of Argos, searching for more knowledge, educating the young, and ensuring the truth is persevered. Her origin and history are unknown, but her mission is clear.\n\nA mysterious woman with tall, long horns is posed with a book in her hand and a satchel with scrolls strapped over her shoulder. She is older and has a strange aura around her, but she is strong and confident. Her knowledge is her power."},
        {"append": "citra-aspirant-rose-knight", "name": "Citra, Aspirant Rose Knight", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/citra-aspirant-rose-knight-full-art.jpg", "text": "Citra is the newest addition to the Rose Knights, but is extremely talented and shows a lot of promise. While she hasn’t been able to go on any of the important missions yet, she was responsible for maintaining the Rose Garden while Auron and the others were off fighting Metaial.\n\nA young knight walks through the early morning market with a somber look. She is wearing beautiful white and gold armor with a purple sash for her sword. Her outfit is complete with her red hooded cloak concealing her face from others. Her apparel makes it difficult to miss her, but she walks around mostly unnoticed.\n\nCitra is an aspiring Rose Knight that will take every opportunity to prove herself. She is her biggest critic, and her worst trait is her undying loyalty to the Rose Knights. She would do anything to bring honor to the Rose Knights, and wants nothing more than to be apart of them. Citra is known for being quick and cunning, and is a valuable asset to the Rose Knights."},
        {"append": "cloudsea-pteromyini", "name": "Cloudsea Pteromyini", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/cloudsea-pteromyini-full-art.jpg", "text": "The Pteromyini is a common sight within Turrim, and are usually harmless. Only being able to fly with the help of the air, these small creatures are usually seen gliding through the trees. However, with a small gust, they can soar through the air for hours. They are also incredibly quick, so it is often very difficult to catch them!\n\nThe Cloudsea Pteromyini is a giant flying squirrel, the same from Cloudsea Beast Tamer.\n\nA Pteromyini glides through the air with the help of a small tornado that is tossing a Hellish Guardhound into the sky. These extremely adorable creatures can be cute and cuddly one moment, but dangerous and threatening the next minute.\n\nThe Pteromyini are great friends of the Skyraiders, and are often found as both pets and allies in battle. These two subtypes thrive together, and have shared a symbiotic relationship throughout history."},
        {"append": "decayed-arbiter", "name": "Decayed Arbiter", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/decayed-arbiter-full-art.png", "text": "Most people know the Decayed Arbiter as the “Bringer of Doom” because his arrival ensures death will follow. There is no escaping the inevitable doom either, once he has decided it is your time nothing will stop him from carrying out his mission. The Arbiter is not only a scary sight, but a death sentence.\n\nA decaying and deformed being, with characteristics similar to an angel. One of its wings is full of dark purple feathers, while the other is broken and void of feathers. The Arbiter’s body is decayed and is wrapped in a purple cloak. It wields a long scythe, and is pictured in front of a full moon with ominous clouds filling in the sky around it.\n\nThe Decayed Arbiter brings about the end of life, and can only be seen by those who it wants. The large scythe it carries around is a symbol throughout Hokken for impending death, and is found on paintings throughout the Evaerie Bog. Many people in Hokken pay tribute to the Decayed Arbiter out of fear, but also to show their respect for the Dark element."},
        {"append": "expanding-elemental", "name": "Song of the Sky", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/expanding-elemental-full-art.jpg", "text": "Completely harmless as individuals, Expanding Elementals are some of the friendliest creatures in all of Argos. They are usually playful and energetic, but tend to be a little mischievous as well. When aggravated or scared, they call others to help. The massive swarm of Elementals is usually enough to intimidate their opponent, otherwise they suffocate them to death.\n\nOn the banks of a river, a Water Elemental emerges and starts to clone itself into another Water Elemental. You can see inside the body of the Water Elementals, a blue shard shining. The Water Elemental is adorable and friendly.\n\nThese cute little Elementals love to splash around and are very playful. They enjoy playing with the fish and other aquatic live, but can sometimes be over friendly. They will sometimes clone themselves just to have a friend to play with. If the Expanding Elemental feels threated it will continue to expand to overwhelm the opponent."},
        {"append": "golem-of-allurement", "name": "Golem of Allurement", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/golem-of-allurement-full-art.jpg", "text": "The golems assembled by Hoenna are used for many different reasons, and fill a specific role in ensuring success. Golem of Allurement was constructed to take control of the opponent and lead them back to Hoenna. What happens next is unknown, but its pretty clear it isn’t good.\n\nA beautiful woman with a stunning figure in a red and white dress captivates a young couple. They are so entranced by her looks they can’t notice the obvious clues. Pale skin, no words, and a cold touch. She is the Golem of Allurement. She opens her unhindged jaw ready to claim two more victims for Hoenna.\n\nIn District Gloom it is advised to not go out after dark unless you need to, in fear of running into one of Hoenna’s Golems. Each Golem is constructed by their master in a certain way, in order to fulfill a role in her grand scheme. While most people think the Golems’ appearance is grotesque, Hoenna considers them all to be her children and loves them all dearly."},
        {"append": "hoenna-conjurer-supreme", "name": "Hoenna, Conjurer Supreme", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/hoenna-conjurer-supreme-full-art.jpg", "text": "Hoenna, Immoral Conjurer is very well known throughout Turrim for her experiments. The golem creatures that are born from her conjugation are usually hideously misshapen atrocities, only someone like Hoenna could love. While her experiments are usually dark and grotesque, her power is still admired by many. Hoenna and her family of golems reside over the Tower of Darkness.\n\nHoenna, Conjurer Supreme is very well known throughout Turrim, and her children are even more well known. The abominations she creates are hideous deformed monsters, or so others say. Hoenna is known for taking abandoned, lost, or helpless children, and turning them into a golem. Her experiments are often called immoral, but in her eyes she gives them a purpose to their life. She may be cold and dark on the outside, but Hoenna’s love for her children is immeasurable.\n\nA dark female figure riding a large zombie horse comes out of the ominous forest. Her hat commands the attention of anyone who looks in her direction. She is a necromancer and sacrifices people to bring others back to life. With one of her arms outstretched, purple energy starts to raise a fallen assassin to use as a henchman against her enemy."},
        {"append": "iakuma-juggernaut", "name": "Iakuma Juggernaut", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/iakuma-juggernaut-full-art.jpg", "text": "Most believe it to be a statue welcoming travelers to the coastal city, but it is actually a gigantic guardian watching over the ports. These guardians protect the coastal cities from any incoming threat, and help keep the waters clear of danger. The sheer size of an Iakuma Juggernaut is a daunting challenge, but its impenetrable armor makes it almost impossible to defeat!\n\nThis is an animate submerged statue, inspired by the Colossus of Rhodes, but shaped more like Shiva with two sets of arms. It is gigantic bronze/copper statue, covered in barnacles, and shipwrecked materials clung to it. It’s eyes are massive water shards and they’re glowing brightly with crackles of Shardlight. It’s rising out of the ocean and with a massive net and spear in one set of hands, and scimitar sword and seashell horn in the other. Its targets being a number of dragons attacking merchant ships along the coastline off in the distance.\n\nThe Iakuma Juggernaut is a formidable Guardian, who patrols the coastlines protecting cities and ships. These animated statues not only serve as a defense, but also a symbol to most people. Their presence brings comfort and security to those who rely on the sea, and acts as a beacon to sailors who may have lost their way."},
        {"append": "kala-best-friends-forever", "name": "Kala, Best Friends Forever", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/kala-full-art.jpg", "fun": "Fun Fact: This is Damien's favorite card from Ascension!", "text": "The friendship between Ariana and Kala has stood the test of time for as long as they can remember. Through perils and battles, the trust these two share is nearly unbeatable. All seemed prosperous in the land of Argos, but then that progress was halted with the arrival of the Silver King. The fateful duo made their way to the Argent Tower with a small band of resistance to stop the Silver King before his army becomes too powerful.\n\nOn top of the Argent Tower, a defeated Ariana struggles to stand. At the opposite side, the Silver King raises his sword and unleashes a silver beam of energy toward Ariana to finish her off. Just before the beam connects, her best friend, Kala, jumps in the way, taking the blast sacrificing itself, as Ariana looks on in horror.\n\nKala’s sacrifice gave Ariana enough time to escape the Silver King; torn by the loss of her most faithful companion. Ariana vowed to avenge her best friend and put an end to the evil that ravaged this land."},
        {"append": "maiden-of-the-maze-seriah", "name": "Maiden of the Maze, Seriah", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/seriah-full-art.jpg", "text": "Seriah is trapped inside of The Great Magimaze, and is doomed by a spell placed on her from Jubei to stay there her entire life. Wth the help of her trusted friends, Bagoom, the Friendly Beast, the Gatekeeper, and the Magimaze Worm she helps lead wandering travelers through the labyrinth and out to safety.\n\nSeriah has long back hair and is wearing a large yellow sweater that stretches to her knees. The loose sleeves cover her hands and are frayed at the ends.  She doesn’t look unkeep, but the clothing she is wearing is worn and tattered. She is surrounded by the Maze’s white walls as vines are growing up them. With Jubei’s Castle in the background, Seriah leads the way.\n\nMaiden of the Maze, Seriah is a young girl trapped inside Jubei’s labyrith, The Great Magimaze. As King of The Great Magimaze, Jubei has cast a spell on Seriah, barring her from ever leaving the maze. Even though she isn’t able to leave, she knows the way out and helps wandering travelers avoid the number of dead ends and traps scattered throughout. Her friends Bagoom, the Gatekeeper, and the Magimaze Worm work together to stop Jubei from capturing any other souls inside of his treacherous maze."},
        {"append": "mr-kins-cyptic-familiar", "name": "Mr. Kins, Cryptic Familiar", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/kins-full-art.jpg", "fun": "Fun Fact: Mr. Kins was originally going to resemble Jeff’s cat, but turned out to look nothing like him! ", "text": "Mr. Kins, Cryptic Familiar is a genius feline who uses magic and charm to gather intel on his enemy. Most suspect Mr. Kins for a typical housecat, but those who look in his eyes can tell their is something special about him.\n\nA siamese cat familiar is looking over the shoulder of an old water-wizard in his study chamber. The emphasis is on the cat. The room is filled with typical water-faction based alchemists and wizard gadgets, books, and other various items. The cat has an ornate collar and its eyes are brilliant sky blue. This cat is a spy for another wizard, so he should appear to be looking more intently on what the old wizard is doing than a normal care-free cat."},
        {"append": "pengardian-pupil", "name": "Pengardian Pupil", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/pengardian-pupil-full-art.jpg", "text": "Young penguins in Pengardia first train as a group similar to a class. Once the basics have been covered, they begin their training with their own sensei. These Pengardian Pupils are the future of Pengardia and they know that, so they take their training seriously as if the village depends on it. The first thing pupils are taught is the art of the surprise attack, a very common technique in Pengardia.\n\nThe young pupils begin training at a very early age. They train for weeks higher up in the mountain tops, meaning the conditions are more extreme. This helps prepare them for unpredictable conditions, improving their endurance and tolerance. These pupils are put through rigorous tests to ensure they are ready to defend their village before they go on their first mission. They are not given any weapons until the last part of their training, so they can focus on mastering the art of stealth and surprise.\n\nThe Pengardian Pupil is a young penguin who is still very small. His red headband along with his black belt are two articles of clothing that signify a pupil who is still in training. He has a shuriken prepared while his two short swords are sheathed away. Ready for action, the Pengardian Pupil looks focused and poised."},
        {"append": "raging-shardbeast", "name": "Raging Shardbeast", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/raging-shardbeast-full-art.jpg", "text": "Raging Shardbeast’s power is unmatched and the shard protruding from its head is nearly unbreakable. The Raging Shardbeast leaves nothing but ruins behind in its path. Shardbeasts are common to Argos but usually live in open fields away from civilizations.\n\nRaging Shardbeast charge in a straight line, destroying anything in their path. Unable to turn, these beasts cannot be outrun, but can be dodged easily. There are countless tales of Shardbeasts demolishing entire cities and villages, usually, because they are stuck inside.\n\nA large Rhinoceros-looking beast with a large shard protuding from its head (horn) is crashing through a solid brick wall. The shard on its head is strong enough to break whatever it runs into and you can see shardlight coming out of it when it is charging."},
        {"append": "raoyennas-pet-dragon", "name": "Raoyenna's Pet Dragon", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/raoyennas-pet-dragon-full-art.jpg", "text": "A loyal servant to her master, Raoyenna, the Dragon guards the Immortal Phoenix . The dragon’s power comes from the bond between her and the Princess, and when they are separated the dragon becomes weak and vulnerable. With Raoyenna by her side, the dragon’s power is at full capacity and not something you’d like to be staring down.\n\nRaoyenna’s Pet Dragon is a large red dragon with thick tough scales. The dragon will do anything it can to protect the Princess, Raoyenna. Together they make a fierce duo and  fight off the evil within Turrim. Her dragon is a fitting pet for Raoyenna, as she is an immortal Phoenix who is reborn once destroyed. The Dragon is always loyal to her and is always there to protect her after she is reborn again."},
        {"append": "ravenous-acidic-monger", "name": "Ravenous Acidic Monger", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/ravenous-acidic-monger-full-art.jpg", "text": "Acid Mongers are common to find around the land of Argos, and have many different variations. The acidic slime from these creatures can burn through metals and plastics, and will erode anything it touches for too long. This ravenous beast is both foul and ugly.\n\nThis large Acid Monger has sharp teeth and reeks of stink. He has two antennas near his mouth that is oozing acidic slime on a small horse, melting its flesh. This monger stands around 5 feet tall, and would be a threat to any human it came into contact with. The large spikey shell on his back helps him protect himself from other predators.\n\nThe Ravenous Acid Monger is the largest of the Mongers on Turrim, and can commonly be found in dark forests. Their eyestalks help them see in all directions, and can help them see around trees while hidden. They are also poached for their large shell and to harvest their acid for ill-intent. Hunters should be weary taht these beasts can spit their acidic slime up to 30 feet."},
        {"append": "shadow-liger", "name": "Shadow Liger", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/shadow-liger-full-art.jpg", "text": "The Shadow Liger stalks its prey approaching silently. This unit strikes before it can be seen, and slashes its enemies with its massive claws. The Shadow Liger is not something you want to come across when the forest is dark.\n\nThe Shadow Liger is a large, shadowy, and fierce purple and black Liger, similar to a tiger/lion. It leaps forward from the shadows, slashing and ripping through the armor of a solider with silver armor. The massive claws leave deep wounds and blood is gushing from the soldier’s body.\n\nThis predator stalks its prey in the shadows, undetectable. Then without being noticed they pounce on their victim and knock them to the ground. The size and strength of this beast is enough to take any soldier down, but the claws can shred through any armor as well. Even the most brave warriors are weary of the Shadow Liger."},
        {"append": "thief-of-valoi", "name": "Thief of Valoi", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/theif-of-valoi-full-art.jpg", "text": "The Thief of Valoi is notorious for getting away with her heist jobs. Valuables must be locked up with the tightest security, and even that won’t stop her. Not only is she incredibly intelligent and can get around any trap, her speed and agility make it almost impossible to catch her. If she wants something, she is going to find a way to get her hands on it!\n\nA daring thief is sprinting through a trap without hesitation. Her stride is steady and she dodges the arrows with grace, as if she’s done this before. She knows if she misses a step or slows down at all, she risks being caught. Carrying a neckless that has large shards on the end that are emanating Shardlight, coins and other jewelry falls out of her clutch bag as she makes her getaway. Her tight leather suit and gorgeous red hair is all they see as she races past them.\n\nThis isn’t the Thief of Valoi’s first heist job, and definitely won’t be her last. At this point she has made so much coin from her jobs that she is just stealing for the thrill of it now. The adrenaline rush and extreme pressure a heist puts on her fills her with life."},
        {"append": "voidfire-dragon", "name": "Voidfire Dragon", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/voidfire-dragon-full-art.jpg", "fun": "Fun Fact: Voidfire Dragon was originally named Voidfire Phoenix! ", "text": "Voidfire Dragon‘s breath can burn entire villages to the ground. This dragon has so much voidfire coursing through its body you can feel the heat coming off of it. Raine, Mournful Commander is the only mortal being who is able to tame this dragon’s power.\n\nThe Voidfire Dragon is a dark gray, black or dark green dragon. It breaths a purple flame.The pose should be intimidating and menacing and shows the dragon landing on top of stone/brick building, about ready to blow fire. There are merchants and wizards in the foreground running or paralyzed in fear.\n\nLiving in the voidfire wasteland this dragon is rarely encounter by humans, and those who do come across one are lucky to live. The voidfire from this dragon will disintegrate most of what it touches. Voidfire Dragon is sight to behold, but usually a deadly one."},
        {"append": "warden-of-vrscika", "name": "Warden of Vrscika", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/warden-of-vrscika-full-art.jpg", "text": "The Warden of Vrscika watches over Vrscika, the Scorpion Hammer to ensure the deadly weapon does not fall into the wrong hands. The power inside the ancient hammer is more than one would think, and the history of the Gear runs deep. The Warden’s sole responsibility is to protect and watch over the artifact.\n\nThe Warden of Vrscika is challenged with a very important duty, and that is to protect Vrscika, the Scorpion Hammer from falling into the wrong hands. The power inside the hammer could wipe out all of an element’s defense, so its important to keep the weapon safe at all times.\n\nThe Warden carefully watches over his weapon, only using it when facing larger opponents. He cracks his knuckles as he approaches what is probably the last of his victims. With two soldiers laying at the feet of the Warden, the last soldier attempts to run away."},
        {"append": "white-rose-knight", "name": "White Rose Knight", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/white-rose-full-art.jpg", "text": "The White Rose Knight is apart of Auron’s Rose Knight army, and is the most experienced member outside of Auron himself. The Rose Knights are well known throughout Turrim for being extremely good at their job. Auron, along with Blue, Red, Black, and White form the fearsome group.\n\nThe White Rose Knight, or as his friends know him, Phlox, is the team lead whenever Auron is not around. By not allowing his surroundings to distract him, Phlox is only focused on the task at hand and is always on time. His knives are his primary weapon of choice, and with deadly precision he is able to take out any foe no matter how large. Although he benefits and works best with a team around him, Phlox is not someone you want to come face to face with.\n\nThe White Rose is skilled with blades, mostly short swords and daggers. He has a shaved head and goatee with his armor mostly white with gold trim. He is juggling four daggers while standing underneath an archway that leads to a maze garden waiting for the other Rose Knights. The White Rose Knight is seen as the second in command of the spectacular Rose Knights."},

        {"append": "ready-for-war", "name": "Ready for War", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/ready-for-war-full-art.jpg", "text": "As the Silver Army approaches, Dragonholt and the remaining Blazewalkers prepare to go head first into a brutal war to stop Metaial. Noticeably missing from the group is Raine, who used to be the Blazewalker Commander. Metaial took advantage of the grief Raine was holding onto from his past, and corrupted him into a Silver General to fight for his army. The group stands on a high ledge, anxious, but Ready for War.\n\nTension in the land of Argos has started to boil over, and there is a sense of a larger danger. Raine has been missing for weeks, which has caused a lot of confusion and worry. Dragonholt readies the Blazewalkers for what appears to be a battle of a life time. \n\nDragonholt and the Blazewalkers all stand together on a ridge, with a cloudy sky behind them. The sunset illuminates the horizon while the dark clouds begin to creep in. Blazewalker Scout, Leiah and Blazewalker Lieutenant Rei stand at Dragonholt’s sides, while Ark and Fang approach from the edges. They all have their weapons drawn, Ready for War."},
        {"append": "ritual-of-ashes", "name": "Ritual of Ashes", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/ritual-of-ashes-full-art.jpg", "text": "A Hand of Raoyenna is cloaked in a dark red robe, and carries a staff resembling the sun.  He raises his staff over his head creating a cloud of embers that form into a phoenix-like shape, beginning the Ritual of Ashes. The color of the fire is bright and vibrant, and serves as a beacon of hope where . The background is smoky and filled with loose embers flying around.\n\nThis ritual pays tribute to the Rao’s greatest hero, Raoyenna the Phoenix. The spell gathers the strength of the smoldering ashes, and transfers the power from the fallen to those still fighting, making their fire burn longer and brighter. The energy from the once burning fire has been reborn again into a new form, similar to the Phoenix. "},
        {"append": "song-of-the-sky", "name": "Song of the Sky", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/song-of-the-sky-full-art.jpg", "text": "There is a specific melody played that brings happiness and joy to crew mates on the airship. During long voyages, this song is commonly used to reinforce camaraderie and hope throughout the tiresome journey. When this song is played birds fly above and sing along, and every crew mate joins in singing the chorus. It is known as the Song of the Sky.\n\nLooking up you can see two large birds soaring high in the sky with a young recruit standing in the crows nest of an airship. He is playing a wooden flute. The sky is filled with clouds as the sun sets behind them.\n\nThe Song of the Sky is sung by all the airships, and is a familiar tune to both veterans and children. The beautiful harmony with the birds creates a peaceful and relaxing feeling for anyone near. The song rejuvenates spirits and fills people with joy."},

        {"append": "academy-of-argos", "name": "Academy of Argos", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/academy-of-argos-full-art.jpg", "text": "The Academy of Argos is the premier school of witches, and is home to the largest library in Arogs full of all different kinds of books. In order to get in, aspiring witches must pass a multitude of tests to see if they are ready to undergo training at the Academy. Young witches train and study hard in hopes they will someday be as fantastic as Madam Phantasm.\n\nThe Academy of Argos is flourishing with young and vibrant academics. Outside the Main Hall students gather around the fountain enjoying the day. The active student life contributes to the many advantages of studying at the Academy. Inside the Main Hall is the most extensive library in all of Argos!\n\nThe beautiful blue-green color and stunning architecture of the buildings highlights the entire campus. The cobblestone path leads to the largest building, the Main Hall. A fountain is positioned outside the Main Hall, and is a hub for student life. Pillars of water line the buildings where bushes and trees would normally be."},
        {"append": "skytree-command-center", "name": "Skytree Command Center", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/skytree-command-center-full-art.jpg", "text": "Skytree Command Center is the central hub for the Skytree army, and is vital in launching their coordinated attacks. The command center is always being restocked with new recruits and returning fleets. The success of their intricate and delicate strategy, that sets them apart, can be contributed to the Skytree Command Center.\n\nInside the Skytree Command Center is a large room full of computers and steam-powered technology. Natural wood and steampunk technology makes up most of the room. Projecting in the middle of the room is a large holographic map of an airship army sailing through the sky. A few Skytree officers are standing around the perimeter of the room, while two higher ranking officers are strategically looking at the holographic map.\n\nFloating high in the sky on a disguised ship, the Skytree Command Center is both mobile and hidden. It would be disastrous if someone was able to infiltrate the Command Center and leak the armies top-secret plans to their enemies. For this reason the Skytree are very careful to protect and disguise their headquarters."},
        {"append": "the-great-magimaze", "name": "The Great Magimaze", "url": "https://argent-saga-card-bucket.s3.amazonaws.com/the-great-magimaze-full-art.jpg", "text": "Seriah is trapped within The Great Magimaze for the rest of her life, but that doesn’t stop her from helping guide lost strangers out of the endless maze. Watch out for Jubei, King of the Magimaze and his pesky servants. They will do whatever they can to try and keep you trapped in the maze forever!\n\nThe Great Magimaze is an elaborate and sophisticated maze that is so large it invites travelers to try their luck in the maze rather than going around. A dense white fog fills the maze, hiding the dangers and troubles inside, but the castle in the center of the maze can be seen clearly. Outside of the entrance stand two giant statues watching over the garden just inside.\n\nBagoom, the Friendly Beast, Magimaze Gate Keeper, and the Magimaze Worm will help lead you Through Dangers Untold, but Jubei, King of the Magimaze and his loyal servants will make it as difficult as possible. Jubei’s crystal ball allows him to keep an eye on anyone trying to escape! "}

    ]
}